# Используем официальный образ Python
FROM python:3.12-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем сначала файл с зависимостями для кэширования слоев Docker
COPY requirements.txt .

# Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь остальной код проекта в рабочую директорию
COPY . .

# Сообщаем Docker, что контейнер будет слушать порт 8000
EXPOSE 8000

# Команда для запуска приложения при старте контейнера
# Используем 0.0.0.0, чтобы приложение было доступно извне контейнера
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]
